export interface FAQNode {
  title: string;
  children?: FAQNode[];
  answer?: string;
}

//A pre-defined Q&A repository for chatbot use.
export const faqData: FAQNode = {
  title: "שאלות נפוצות",
  children: [
    {
      title: "הרשמה וכניסה",
      children: [
        {
          title: "מהם כללי האתר?",
          answer: "לכללי האתר, ניתן ללחוץ על כפתור התקנון שבתחתית העמוד.",
        },
        {
          title: "איך נרשמים לאתר?",
          answer:
            "יש ללחוץ על כפתור 'הרשמה' בראש העמוד ולמלא את הפרטים הנדרשים.",
        },
        {
          title: "מדוע אני לא מצליח להירשם לאתר?",
          answer:
            "אם אינך מצליח להירשם, ודא שהמייל שלך תקין ושהסיסמה עונה לדרישות האתר. אם הבעיה נמשכת, צור קשר עם התמיכה.",
        },
        {
          title: "האם מותר לי להחזיק יותר מחשבון אחד?",
          answer:
            "לא. כל הורה רשאי להחזיק חשבון אחד, ויועץ רשאי להחזיק חשבון יועץ וחשבון הורה אחד בלבד.",
        },
        {
          title: "האם יש גרסה ניידת לאתר?",
          answer:
            "כן, האתר מותאם גם למכשירים ניידים. תוכל לגשת לפורום מכל מכשיר ולנהל את החשבון שלך בקלות.",
        },
        {
          title: "האם כתובת המייל שלי תהיה חשופה למשתמשים אחרים?",
          answer:
            "כלל לא! אולם אם תבחר ליצור קשר אישי עם יועץ, כתובת המייל שלך תועבר אליו על מנת שיוכל להמשיך ליצור איתך קשר. כך גם אם תבחר ליצור קשר עם צוות האתר, באמצעות הכפתור צור קשר שבתחתית העמוד.",
        },
      ],
    },
    {
      title: "שימוש בפורום",
      children: [
        {
          title: "איך מפרסמים אשכול חדש בפורום?",
          answer:
            "לאחר הכניסה לחשבונך, לחץ על 'אשכול חדש', כתוב את השאלה בצורה מפורטת ולחץ על 'פרסם'.",
        },
        {
          title: "איך מגיבים לאשכולות של אחרים?",
          answer:
            "יש ללחוץ על כפתור 'הוסף תגובה' מתחת לפוסט. אורחים אינם יכולים להגיב.",
        },
        {
          title: "איך ניתן לערוך או למחוק תגובה שפרסמתי?",
          answer:
            "עריכת פוסט אינה אפשרית. מחיקת תגובות נעשית רק על ידי צוות האתר.",
        },
        {
          title: "איך ניתן לדווח על תוכן לא הולם?",
          answer:
            "ליד כל פוסט ותגובה יש כפתור 'דיווח'. לחיצה עליו תשלח דיווח למנהלי הפורום.",
        },
        {
          title: "איך אני פונה לצוות האתר אם יש לי שאלה או המלצה?",
          answer:
            "יש ללחוץ על כפתור צור קשר שנמצא בתפריט התחתון של האתר. ניתן למלא טופס עם פרטיך ולכתוב את הרקע לפניתך.",
        },
        {
          title: "איך אני מוצא אשכולות בנושאים מסוימים?",
          answer:
            "ניתן להשתמש בשדה החיפוש שממוקם בראש הדף. הקלד את מילת המפתח או נושא האשכול שאתה מחפש, והאתר ימצא את האשכולות המתאימים.",
        },
      ],
    },
    {
      title: "בעיות ותמיכה טכנית",
      children: [
        {
          title: "מדוע האתר לא מגיב או נטען לאט?",
          answer:
            "נסה לרענן את הדף, לוודא חיבור יציב לאינטרנט, ולבדוק אם קיימים עדכונים בדפדפן שלך.",
        },
        {
          title: "אני מקבל שגיאה בעת פרסום פוסט, מה לעשות?",
          answer:
            "נסה לטעון מחדש את הדף ולוודא שהחיבור שלך תקין. אם הבעיה נמשכת, צור קשר עם התמיכה הטכנית.",
        },
        {
          title: "איך ניתן לערוך או למחוק תגובה שפרסמתי?",
          answer:
            "עריכת פוסט אינה אפשרית. מחיקת תגובות נעשית רק על ידי צוות האתר.",
        },
        {
          title: "האתר לא מוצג נכון בדפדפן שלי, איך אני פותר את הבעיה?",
          answer:
            "ודא שהדפדפן שלך מעודכן לגרסה האחרונה. אם הבעיה נמשכת, נסה להשתמש בדפדפן אחר או לפנות אלינו דרך צור קשר המופיע בתחתית הדף.",
        },
        {
          title: "איך ניתן ליצור קשר עם צוות האתר?",
          answer: "ניתן לפנות דרך הכפתור צור קשר  המופיע בתחתית הדף.",
        },
      ],
    },
    {
      title: "שאלות הורים",
      children: [
        {
          title: "הצטרפות לפורום",
          children: [
            {
              title: "האם יש דרישות מיוחדות להצטרפות לפורום?",
              answer:
                "אין דרישות מיוחדות. כל הורה המעוניין לקבל תמיכה או להעלות שאלות יכול להצטרף ולהשתמש בפורום.",
            },
            {
              title: "האם אני יכול לשאול שאלה לגבי ילד שאינו שלי?",
              answer:
                "כן, אתה יכול לשאול על בעיות חינוכיות של ילדים אחרים, אך חשוב לשמור על פרטיות הילדים ולהימנע משיתוף מידע אישי מזהה.",
            },
            {
              title: "האם אני יכול לשאול שאלות גם אם אני לא הורה או יועץ?",
              answer:
                "הפורום מיועד להורים וליועצים, אך תוכל לשאול שאלות בנוגע לנושא החינוך אם מדובר בשאלה כללית שיכולה להועיל.",
            },
            {
              title: "האם הפורום מיועד רק להורים עם ילדים בגיל מסוים?",
              answer:
                "הפורום פתוח להורים בכל הגילאים ובכל שלב בחיים, כאשר כל אחד יכול למצוא את התמיכה שמתאימה לצרכים שלו.",
            },
          ],
        },
        {
          title: "מענה מיועצים",
          children: [
            {
              title: "איך אני יכול לדעת אם היועץ שענה לי הוא באמת מומחה בתחום?",
              answer:
                "כל יועץ מציג את תחום ההתמחות שלו, תעודותיו והניסיון שלו, כך שתוכל להתרשם מהידע המקצועי לפני שאתה פונה אליו.",
            },
            {
              title:
                "איך אדע אילו תגובות נכתבו על ידי יועצים ואילו על ידי הורים?",
              answer:
                "כל היועצים בפורום הם אנשי מקצוע מוסמכים עם ניסיון בתחום, והם מספקים תשובות מבוססות על הידע שלהם.",
            },
            {
              title: "האם יש אפשרות להיפגש עם יועץ באופן אישי מעבר לפורום?",
              answer:
                "כן, במידה והיועץ מציע שירותים אישיים, תוכל ליצור קשר עם היועץ דרך האתר ולהסכים על פגישה פרטית או שיחת ייעוץ.",
            },
            {
              title: "איך אני יודע אם התשובות בפורום הן נכונות ומבוססות?",
              answer:
                "כל היועצים בפורום הם אנשי מקצוע מוסמכים עם ניסיון בתחום, והם מספקים תשובות מבוססות על הידע שלהם.",
            },
          ],
        },
        {
          title: "שמירה על פרטיות ואנונימיות",
          children: [
            {
              title: "האם אפשר להישאר אנונימי בעת העלאת שאלה לפורום?",
              answer:
                "לא ניתן להישאר אנונימי לגמרי, אך ניתן ליצור שם משתמש שאינו מסגיר את זהותך. כתובת האימייל שלך חשופה רק לצוות האתר, או ליועץ שתבחר לפנות אליו.",
            },
            {
              title: "האם אני יכול לשתף את הפורום עם קולגות או אנשים אחרים?",
              answer:
                "כן, אתה מוזמן לשתף את הפורום עם אחרים שיכולים להפיק ממנו תועלת. הפורום פתוח לכל מי שמתעניין בתחום החינוך.",
            },
            {
              title: "האם מותר לי לשתף מידע אישי על הילד שלי?",
              answer:
                "לא, יש להימנע משיתוף מידע אישי מזהה של ילדיכם או של אחרים, כדי לשמור על פרטיותם.",
            },
          ],
        },
        {
          title: "פניות והמשך ייעוץ",
          children: [
            {
              title: "האם יש דרך לשמור על קשר עם היועץ לאחר שסיים לענות לי?",
              answer:
                "כן, ניתן ליצור קשר ישיר עם היועץ דרך האתר אם אתה מעוניין בהמשך ייעוץ אישי ומעמיק.",
            },
            {
              title: "האם יש אפשרות לשוחח עם יועץ אחד לאורך זמן?",
              answer:
                "כן, ניתן ליצור קשר עם יועץ מסוים באופן פרטני ולבקש ייעוץ לאורך זמן, במיוחד אם מצאתם יועץ שמתאים לכם.",
            },
            {
              title: "האם אני יכול לפנות ליועץ אחר אם אני לא מרוצה מהמענה?",
              answer:
                "אם אינך מרוצה מהמענה, תמיד תוכל לפנות ליועץ אחר או לשאול את השאלה מחדש עם יותר פרטים.",
            },
          ],
        },
        {
          title: "שאלות ותשובות על סוגי בעיות",
          children: [
            {
              title:
                "האם הפורום מתאים גם לשאלות על חינוך מיוחד או בעיות פרטניות?",
              answer:
                "כן, הפורום כולל יועצים שמתמחים בחינוך מיוחד ובתחומים פרטניים נוספים. תמיד מומלץ לוודא עם היועץ שהתשובה מתאימה למצב הספציפי שלך.",
            },
            {
              title:
                "האם הפורום מיועד גם לנושאים חינוכיים מחוץ למסגרת בית הספר?",
              answer:
                "בהחלט, הפורום מיועד לכל שאלה חינוכית, גם כזו שקשורה לפיתוח אישי של הילד, חינוך בבית או בעיות התנהגות מחוץ לבית הספר.",
            },
            {
              title:
                "האם אפשר להעלות שאלות על בעיות חינוכיות משפחתיות, כמו התמודדות הילדים עם נישואים שניים של אחד ההורים?",
              answer:
                "אין הגבלה, אך חשוב לנסח כל שאלה בצורה ברורה וממוקדת כדי שהמענה יהיה מדויק.",
            },
          ],
        },
        {
          title: "מגבלות ונהלים",
          children: [
            {
              title: "האם יש הגבלה על כמות השאלות שאני יכול לשאול?",
              answer:
                "אין הגבלה על כמות השאלות, אך מומלץ להימנע משאלות חוזרות כדי לא להעמיס על היועצים ולשמור על סדר.",
            },
            {
              title: "האם יש מגבלות על סוגי השאלות שניתן לשאול בפורום?",
              answer:
                "השאלות צריכות להיות קשורות לחינוך ולגידול ילדים. יש להימנע משאלות שאינן רלוונטיות או מפרות את התקנון.",
            },
            {
              title: "מה קורה אם יש לי שאלה שחורגת מהנושא החינוכי?",
              answer:
                "הפורום מיועד בעיקר לנושאים חינוכיים, ולכן שאלה שאינה קשורה ישירות לנושא עשויה לא לקבל מענה, אך תמיד ניתן להתייעץ עם היועץ האם השאלה מתאימה.",
            },
            {
              title: "האם יש זמן מקסימלי להמתנה תשובות ליועצים?",
              answer:
                "בדרך כלל, היועצים מנסים לענות בהקדם, אך זמן התגובה עשוי להשתנות בהתאם להיקף השאלה ולזמינות היועצים.",
            },
          ],
        },
      ],
    },

    {
      title: "שאלות יועצים",
      children: [
        {
          title: "הרשמה וחוקי הפורום",
          children: [
            {
              title:
                "אני חושש להזין את מספר הזהות או מספר הפלאפון באתר ציבורי.",
              answer:
                "מספר הזהות ומספר הפלאפון חשובים מאוד לצורך אימות. אולם הם לא יפורסמו בשום שלב!",
            },
            {
              title: "האם אני צריך לשלם כדי להיות יועץ בפורום?",
              answer:
                "לא, ההצטרפות ליועצים ולמתן ייעוץ בפורום היא בחינם. אתם מקבלים חשיפה והזדמנות להציג את הידע שלכם מבלי עלות.",
            },

            {
              title: "האם גם יועץ חינוכי יכול לשאול שאלה בפורום?",
              answer:
                "למען שמירה על סדרי הפורום, יועץ לא יכול לשאול שאלה כיועץ. עליו לפתוח חשבון חדש כהורה, עם מייל נפרד.",
            },
            {
              title: "האם אפשר לענות גם על שאלות בתחומים שלא התמחיתי בהם?",
              answer:
                "חשוב שהיועץ יענה רק על שאלות בתחום ההתמחות שלו, אך אם יש צורך בהכוונה כללית, הוא יכול להפנות את ההורה למומחים נוספים.",
            },
            {
              title: "איך אני יודע אם אני יכול לענות לשאלה מסוימת?",
              answer:
                "עליך להיות מקצועי ולהגיב רק לשאלות בהן יש לך ידע וניסיון. אם אינך בטוח, עדיף להפנות את השאלה ליועץ מתאים.",
            },
          ],
        },
        {
          title: "למה כדאי לי להירשם לפורום?",
          children: [
            {
              title: "מה היתרונות שאני יכול לקבל כיועץ מקצועי בפורום הזה?",
              answer:
                "הפורום מציע לכם פלטפורמה מקצועית להציג את הידע שלכם, לקבל חשיפה לקהל יעד ממוקד (הורים), וליצור קשרים מקצועיים עם הורים שמחפשים ייעוץ בתחום החינוך.",
            },
            {
              title: "מה היתרון של פלטפורמה מקצועית כמו הפורום הזה?",
              answer:
                "האתר מספק לכם במה מקצועית בולטת ומאפשר לכם להציג את תחומי ההתמחות שלכם לקהל הממוקד. זהו מקום אידיאלי להרחיב את מעגל הלקוחות שלכם.",
            },
          ],
        },
        {
          title: "קשר עם ההורים",
          children: [
            {
              title:
                "האם אני יכול להמשיך ולהיות בקשר עם ההורים אחרי שעניתי להם?",
              answer:
                "כן, תוכלו להמשיך ולייעץ להורים באופן פרטני, אולם רק לאחר שההורים פנו אליך באופן פרטני והסכימו לחשוף את כתובת המייל שלהם.",
            },
            {
              title:
                "האם אני יכול להמליץ להורים לפנות אלי למפגשים אישיים בתשלום?",
              answer:
                "כל ההמלצות צריכות להיות מקצועיות וממוקדות בייעוץ חינוכי. אם אתה רוצה להציע ייעוץ אישי בתשלום, תוכל לעשות זאת בתיאום עם הנהלת האתר.",
            },
          ],
        },
        {
          title: "תוכן ופרסום",
          children: [
            {
              title: "האם מותר לי להמליץ על ספרים או חומרי קריאה שאני מכיר?",
              answer:
                "כן, אך חשוב שההמלצות יהיו מבוססות על ידע מקצועי ומדויק. אסור להשתמש בפורום לפרסום אישי או למטרות שיווקיות.",
            },
            {
              title: "האם יש לי חופש לפרסם פרטים נוספים בפרופיל היועץ שלי?",
              answer:
                "כן, אך חשוב להציג רק פרטים אמיתיים ומדויקים בפרופיל היועץ, לשם שקיפות ואמינות.",
            },
            {
              title: "האם מותר לי לפרסם שירותים או מוצרים בפורום?",
              answer:
                "לא, יש לקבל אישור לפני פרסום שירותים או מוצרים. פרסום כזה ללא אישור יימחק.",
            },
            {
              title:
                "האם אני יכול להמליץ להורים לפנות אלי למפגשים אישיים בתשלום?",
              answer:
                "כל ההמלצות צריכות להיות מקצועיות וממוקדות בייעוץ חינוכי. אם אתה רוצה להציע ייעוץ אישי בתשלום, תוכל לעשות זאת בתיאום עם הנהלת האתר.",
            },
          ],
        },
      ],
    },
    {
      title: "שאלות אודות הפורום",
      children: [
        {
          title: "השתתפות ופעילות בפורום",
          children: [
            {
              title: "האם גם מי שאינו יועץ יכול להגיב לאשכול?",
              answer:
                "בוודאי, הפורום מיועד עבור דיונים הדדיים. אם יש לך מה להוסיף, כחלק מניסיון החיים שרכשת או כדעה אישית – אנחנו מעוניינים לשמוע!",
            },
            {
              title: "מה מיוחד בפורום החינוכי הזה?",
              answer:
                "הפורום שלנו מציע תמיכה וסיוע להורים בנושאי חינוך וגידול ילדים, עם מענה מקצועי ממיטב היועצים בתחום. אנחנו מאמינים בכוח של קהילה תומכת ומבינה, ומספקים כלים ועצות מותאמות אישית.",
            },
            {
              title: "האם הפורום פתוח בכל זמן?",
              answer:
                "כן, הפורום זמין בכל שעה, כך שאתם יכולים להעלות שאלות ולקבל תשובות בכל עת, ללא עלות.",
            },
            {
              title: "מה הקשר בין יועצים להורים בפורום?",
              answer:
                "היועצים בפורום מעניקים מענה מקצועי לשאלות הורים בנושאי חינוך וגידול ילדים, ומספקים תמיכה וייעוץ איכותי.",
            },
          ],
        },
        {
          title: "השתתפות של משתמשים שאינם הורים או יועצים",
          children: [
            {
              title: "למה כדאי לי להצטרף לפורום?",
              answer:
                "הפורום מציע תמיכה מקצועית, חשיפה לקהל ממוקד ויכולת ליצור קשרים מקצועיים, תוך שמירה על איכות ודיוק המענה.",
            },
            {
              title: "האם אני יכול לשאול שאלות גם אם אני לא הורה?",
              answer:
                "הפורום מיועד להורים וליועצים בתחום החינוך, אולם גם אם אינך הורה תוכל להשתתף בשיח אם יש לך שאלות או צורך בעצה בנושאים חינוכיים.",
            },
            {
              title: "האם הפורום מתאים גם למדריכים?",
              answer:
                "כן, הפורום מתאים לכל מי שהוא בעל סמכות ואחריות על ילדים, ורוצה לדעת כיצד לחנכם בצורה הטובה ביותר.",
            },
          ],
        },
        {
          title: "מדיניות פרסום וכללי התנהגות",
          children: [
            {
              title:
                "האם אני יכול להמליץ על פורומים אחרים או שירותים חינוכיים?",
              answer:
                "אין לפרסם שירותים או מוצרים ללא אישור מראש ממנהלי הפורום. כל פרסום חיצוני יימחק.",
            },
            {
              title: "מהם כללי ההתנהגות החשובים ביותר בפורום?",
              answer:
                "שמירה על כבוד הדדי, התייחסות עם סבלנות ודיוק בתיאור הבעיה. אנו מבקשים לא לשתף מידע אישי או להשתמש בשפה פוגענית.",
            },
            {
              title: "האם אפשר לשתף תשובות מהפורום עם אחרים?",
              answer:
                "כן, ניתן לשתף את התשובות עם אחרים, אך חשוב לציין את מקור המידע ולהימנע משיתוף תוכן אישי של משתתפים אחרים.",
            },
          ],
        },
        {
          title: "נגישות ושירות",
          children: [
            {
              title: "האם הפורום מספק התאמה לעיוורים?",
              answer:
                "כן, משתמשים רשומים יכולים ללחוץ בכל אשכול על הכפתור בראש הדף על מנת להתחיל את השמעת האשכול והתגובות.",
            },
            {
              title: "האם הפורום תומך בהקלדה קולית?",
              answer:
                "כן, אם ברצונך להגיב לאשכול – תוכל להקליד את תגובתך בנוחות מירבית, באמצעות קולך.",
            },
            {
              title: "כיצד ניתן ליצור קשר עם שירות הלקוחות?",
              answer: "ניתן ללחוץ על כפתור 'צור קשר' שבתחתית העמוד.",
            },
          ],
        },
      ],
    },
  ],
};
